{
  "filename": "create.md",
  "__html": "<h2>Create a site</h2>\n<blockquote>\n<p>After doing the preparatory work, you can now start defining your own site.</p>\n</blockquote>\n<p>Executing the docsite start command in the project root directory will automatically open the page in the browser.</p>\n<p>The template project generated by the initialization integrates the home page, document page, blog list page, blog detail page, community page, and Chinese and English internationalization functions by default. You can add and remove pages yourself as needed.</p>\n<h3>Adding a document</h3>\n<ol>\n<li>Put the corresponding <code>.md</code> or <code>.markdown</code> file into the corresponding language directory under the <code>docs</code> folder to support multi-level directories.</li>\n<li>Configure the menu items for the document in <code>docs.js</code> under the <code>site_config</code> folder.</li>\n</ol>\n<h3>Adding a blog</h3>\n<ol>\n<li>Put the corresponding <code>.md</code> or <code>.markdown</code> file into the corresponding language directory under the <code>blog</code> folder to support multi-level directory directories.</li>\n<li>Configure the list item of the blog in <code>blog.js</code> under the <code>site_config</code> folder.</li>\n</ol>\n<p><strong>Note:</strong></p>\n<p>The markdown file supports custom metadata at the top of the document. The data between the top <code>---</code> (at least three <code>-</code>) is considered to be metadata, and one key occupies one line. Currently, the three fields of <code>title</code>, <code>keywords</code>, and <code>description</code> are supported. When static HTML is generated, it is used as the title of the page label, page keywords, and page description, which is convenient for the search engine to better include the site, thereby facilitating SEO.</p>\n<pre><code class=\"language-js\">---\ntitle: title\n<span class=\"hljs-attr\">keywords</span>: keywords1,keywords2,keywords3\n<span class=\"hljs-attr\">description</span>: some description\n---\n\nYour markdown content\n</code></pre>\n",
  "link": "/en-us/docs/create.html",
  "meta": {
    "title": "Create a site"
  }
}